First Routes And Controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 4]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 4]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
SELECT "artworks".* FROM "artworks"
---
    def index
        # render plain: "I'm in the index action!"
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
            artworkShare = ArtworkShare.where(viewer_id: params[:user_id])
            artworkShare.each do |artShare|
                shared_art = Artwork.where(id: artShare.artwork_id)
                artworks += shared_art
            end
        else
            artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Mona bisa"], ["image_url", "asdfasdf.rg"], ["artist_id", 2]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "Not David"], ["image_url", "notdavid.com"], ["id", 5]]
---
    def update
        artwork = Artwork.find(params[:id])
        artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
---
    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy