First Routes And Controllers/app/controllers/comments_controller.rb

    def index
        # debugger
        if !params[:user_id].nil?
            userr = Comments.where(user_id: params[:user_id])
            render json: userr
        else
            artowkke = Comments.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]

    def create
        comments = Comments.new(comments_params)
        if comments.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["artwork_id", 1], ["body", "aos jdiajsdiasodjaoiwdsajoidsjod iajs od asjdo asjod asjodf asjdi"]]