First Routes And Controllers/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-07-22 15:10:44.992702"], ["updated_at", "2021-07-22 15:10:44.992702"], ["username", "JillDaBeast"]]

    def show
        # debugger
        render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "newName"], ["updated_at", "2021-07-22 15:18:25.147971"], ["id", 1]]